sicrisembay/stm32g4_logger/board/stm32g474_board/main/bsp/sdcard/sdcard.c
/*
 * sdcard.c
 *
 *  Created on: Aug 31, 2024
 *      Author: Sicris Rey Embay
 */

#include "logger_conf.h"
#include "stdbool.h"
#include "string.h"
#include "stm32g4xx_ll_gpio.h"
#include "stm32g4xx_ll_bus.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "sdcard.h"
#include "test_sdcard.h"
#include "bsp/spi/bsp_spi.h"
#include "bsp/lpuart.h"

#define SD_PRINT_DEBUG_ENABLE   (1)
#define SD_PRINTF(x, ...)       (SD_PRINT_DEBUG_ENABLE != 0) ? LPUART_printf(x, ##__VA_ARGS__) : (void)0

#define SD_SPI_PORT             SPI1
#define SD_CS_Pin               LL_GPIO_PIN_4
#define SD_CS_Port              GPIOA

#define SD_DETECT_Pin           LL_GPIO_PIN_4
#define SD_DETECT_Port          GPIOC

#define SD_DEFAULT_TIMEOUT      (100)
#define SD_WAIT_BUSY_TIMEOUT    (100)
#define SD_WAIT_TOKEN_TIMEOUT   (200)

static bool bInit = false;
static SemaphoreHandle_t semHandle = NULL;
static StaticSemaphore_t semStruct;
static uint8_t block_data[SDCARD_BLOCK_SIZE];

typedef struct {
    uint8_t csd_version;
    uint32_t max_block_count;
    uint32_t size;              // Card size in Mega-Bytes (MB)
} SDCARD_T;

static SDCARD_T sdcard = {0};

void SD_ChipSelect(bool bSelect)
{
    if(bSelect) {
        /* Active Low */
        LL_GPIO_ResetOutputPin(SD_CS_Port, SD_CS_Pin);
    } else {
        LL_GPIO_SetOutputPin(SD_CS_Port, SD_CS_Pin);
    }
}


/*
R1: 0abcdefg
     ||||||`- 1th bit (g): card is in idle state
     |||||`-- 2th bit (f): erase sequence cleared
     ||||`--- 3th bit (e): illigal command detected
     |||`---- 4th bit (d): crc check error
     ||`----- 5th bit (c): error in the sequence of erase commands
     |`------ 6th bit (b): misaligned addres used in command
     `------- 7th bit (a): command argument outside allowed range
             (8th bit is always zero)
*/
static int8_t SDCARD_ReadR1() {
    int8_t ret = SPI_ERR_NONE;
    int32_t spiRet = SPI_ERR_NONE;
    int32_t status;
    uint8_t r1;
    BSP_SPI_CLK_T clk;
    if(bInit) {
        clk = (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX;
    } else {
        clk = BSP_SPI_CLK_156KHZ;
    }
    /*
     * Note: command response time (NCR)
     *   SDC : 0-8 bytes
     *   MMC : 1-8 bytes
     */
    uint32_t ncr = 0;
    const uint32_t ncrMax = 12; /* NCR + some margin */
    // make sure FF is transmitted during receive
    uint8_t tx = 0xFF;
    for(;;) {
        // clear pending semaphore
        while(pdTRUE == xSemaphoreTake(semHandle, 0));

        tx = 0xFF;
        spiRet = BSP_SPI_transact(&tx, &r1, 1, SPI_MODE0, NULL, clk, semHandle, &status);
        if(spiRet != SPI_ERR_NONE) {
            SD_PRINTF("Read R1 Error %d\r\n", __LINE__);
            return (int8_t)spiRet;
        }

        if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
            SD_PRINTF("Read R1 Error %d\r\n", __LINE__);
            return SPI_ERR_TIMEOUT;
        }
        if(status != SPI_ERR_NONE) {
            SD_PRINTF("Read R1 Error %d\r\n", __LINE__);
            return (int8_t)spiRet;
        }

        if((r1 & 0x80) == 0) { // 8th bit alwyas zero, r1 recevied
            ret = r1;
            break;
        } else {
            ncr++;
            if(ncr >= ncrMax) {
                SD_PRINTF("Read R1 Timeout %d\r\n", __LINE__);
                return SDCARD_ERR_TIMEOUT;
            }
            vTaskDelay(1);
        }
    }

    return ret;
}

// data token for CMD9, CMD17, CMD18 and CMD24 are the same
#define DATA_TOKEN_CMD9  0xFE
#define DATA_TOKEN_CMD10 0xFE
#define DATA_TOKEN_CMD17 0xFE
#define DATA_TOKEN_CMD18 0xFE
#define DATA_TOKEN_CMD24 0xFE
#define DATA_TOKEN_CMD25 0xFC


static int32_t SDCARD_WaitDataToken(uint8_t token)
{
    int32_t spiRet = SPI_ERR_NONE;
    int32_t status;
    uint8_t fb;
    // make sure FF is transmitted during receive
    uint8_t tx = 0xFF;
    BSP_SPI_CLK_T clk;

    if(bInit) {
        clk = (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX;
    } else {
        clk = BSP_SPI_CLK_156KHZ;
    }

    TickType_t startTime = xTaskGetTickCount();
    for(;;) {
        // clear pending semaphore
        while(pdTRUE == xSemaphoreTake(semHandle, 0));
        tx = 0xFF;
        spiRet = BSP_SPI_transact(&tx, &fb, 1, SPI_MODE0, NULL, clk, semHandle, &status);
        if(spiRet != SPI_ERR_NONE) {
            SD_PRINTF("Wait Data Token Error %d\r\n", __LINE__);
            return (int8_t)spiRet;
        }
        if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
            SD_PRINTF("Wait Data Token Error %d\r\n", __LINE__);
            return SPI_ERR_TIMEOUT;
        }
        if(status != SPI_ERR_NONE) {
            SD_PRINTF("Wait Data Token Error %d\r\n", __LINE__);
            return (int8_t)spiRet;
        }
        if(fb == token) {
            break;
        }
        if(fb != 0xFF) {
            SD_PRINTF("Wait Data Token Error %d\r\n", __LINE__);
            return SDCARD_ERR_WAIT_DATA_TOKEN;
        }
        if((xTaskGetTickCount() - startTime) > SD_WAIT_TOKEN_TIMEOUT) {
            SD_PRINTF("Wait Data Token Timeout %d\r\n", __LINE__);
            return SDCARD_ERR_WAIT_DATA_TOKEN;
        }
    }

    return SDCARD_ERR_NONE;
}


static int32_t SDCARD_ReadBytes(uint8_t * buff, size_t buff_size)
{
    int32_t ret = 0;
    int32_t status = 0;
    BSP_SPI_CLK_T clk;

    if(bInit) {
        clk = (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX;
    } else {
        clk = BSP_SPI_CLK_156KHZ;
    }

    memset(buff, 0xFF, buff_size);
    /* clear */
    while(pdTRUE == xSemaphoreTake(semHandle, 0));
    ret = BSP_SPI_transact(buff, buff, buff_size, SPI_MODE0, NULL, clk, semHandle, &status);
    if(SPI_ERR_NONE != ret) {
        SD_PRINTF("Read Bytes Error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_PRINTF("Read Bytes Error %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status < 0) {
        SD_PRINTF("Read Bytes Error %d\r\n", __LINE__);
        return status;
    }
    return SPI_ERR_NONE;
}


static int32_t SDCARD_WaitNotBusy() {
    uint8_t busy;
    int32_t ret;
    TickType_t startTime = xTaskGetTickCount();
    do {
        ret = SDCARD_ReadBytes(&busy, sizeof(busy));
        if(ret != SPI_ERR_NONE) {
            SD_PRINTF("Wait Busy Error %d\r\n", __LINE__);
            return ret;
        }
        if((xTaskGetTickCount() - startTime) > SD_WAIT_BUSY_TIMEOUT) {
            SD_PRINTF("Wait Busy Timeout\r\n");
            return SDCARD_ERR_TIMEOUT;
        }
    } while(busy != 0xFF);

