sicrisembay/stm32g4_logger/board/stm32g474_board/main/bsp/sdcard/sdcard.c
    return SPI_ERR_NONE;
}


static int32_t SDCARD_SendCMD0(void)
{
    int32_t ret = SDCARD_ERR_NONE;
    int32_t status = 0;
    uint8_t cmd[] =
        { 0x40 | 0x00 /* CMD0 */, 0x00, 0x00, 0x00, 0x00 /* ARG = 0 */, (0x4A << 1) | 1 /* CRC7 + end bit */ };
    BSP_SPI_CLK_T clk;

    if(bInit) {
        clk = (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX;
    } else {
        clk = BSP_SPI_CLK_156KHZ;
    }

    while(pdTRUE == xSemaphoreTake(semHandle, 0));
    ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, clk, semHandle, &status);

    if(ret != SPI_ERR_NONE) {
        SD_PRINTF("CMD0 Error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_PRINTF("CMD0 Error %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status != SPI_ERR_NONE) {
        SD_PRINTF("CMD0 Error %d\r\n", __LINE__);
        return status;
    }
    return SDCARD_ERR_NONE;
}


int32_t SDCARD_Init(void)
{
    int32_t ret = SPI_ERR_NONE;
    int32_t status;
    int8_t r1;
    uint8_t retry;

    /*
     * Note: This must be only called after scheduler has started.
     */
    configASSERT(taskSCHEDULER_NOT_STARTED != xTaskGetSchedulerState());

    TEST_SDCARD_Init();

    LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

    if(bInit == true) {
        return SDCARD_ERR_NONE;
    }

    LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA);
    LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOC);

    BSP_SPI_init();

    /*
     * SD Card SPI CS
     */
    LL_GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.Pin = SD_CS_Pin;
    GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
    GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
    LL_GPIO_Init(SD_CS_Port, &GPIO_InitStruct);
    SD_ChipSelect(false);

#if CONFIG_SDCARD_HAS_DETECT_PIN
    /*
     * SD Card Detect
     */
    LL_GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.Pin = SD_DETECT_Pin;
    GPIO_InitStruct.Mode = LL_GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
    LL_GPIO_Init(SD_DETECT_Port, &GPIO_InitStruct);
    retry = 0;
    while(1) {
        if((LL_GPIO_ReadInputPort(SD_DETECT_Port) & SD_DETECT_Pin) == 0) {
            retry++;
            vTaskDelay(10);
            if(retry >= 10) {
                /* Card not detected.  Hot plug is not supported */
                SD_PRINTF("SD Card not preset\r\n");
                return SDCARD_ERR_NOT_PRESENT;
            }
        } else {
            break;
        }
    }
#endif /* CONFIG_SDCARD_HAS_DETECT_PIN */
    /*
     * Semaphore for synchronization
     */
    semHandle = xSemaphoreCreateBinaryStatic(&semStruct);
    configASSERT(NULL != semHandle);
    /*
     * Step 0.
     *   Add delay to make sure the 3.3V has stabilized
     */
    vTaskDelay(200/portTICK_PERIOD_MS);
    /*
     * Step 1.
     *   Set DI and CS high and apply 74 or more clock pulses to SCLK. Without this
     *   step under certain circumstances SD-card will not work. For instance, when
     *   multiple SPI devices are sharing the same bus (i.e. MISO, MOSI, CS).
    */
    SD_ChipSelect(false);  // CS unselect
    {
        // 96 clock pulses
        uint8_t dummy[12] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
                0xFF, 0xFF, 0xFF, 0xFF};
        while(pdTRUE == xSemaphoreTake(semHandle, 0));
        ret = BSP_SPI_transact(dummy, dummy, sizeof(dummy), SPI_MODE0, NULL, BSP_SPI_CLK_156KHZ, semHandle, &status);
        if(ret != SPI_ERR_NONE) {
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return ret;
        }
        if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return SPI_ERR_TIMEOUT;
        }
    }

    /*
     * Step 2.
     *   Send CMD0 (GO_IDLE_STATE): Reset the SD card.
     *     To enter SPI mode, CMD0 needs to be sent twice (see figure 4-1 in
     *     SD Simplified spec v4.10). Some cards enter SD mode on first CMD0.
     */
    SD_ChipSelect(true);
    /* First CMD0 */
    ret = SDCARD_SendCMD0();
    if(SDCARD_ERR_NONE != ret) {
        SD_PRINTF("SD Init  Error %d\r\n", __LINE__);
        SD_ChipSelect(false);
        return ret;
    }
    r1 = SDCARD_ReadR1();
    /* Toggle CS */
    SD_ChipSelect(false);
    vTaskDelay(1);
    SD_ChipSelect(true);
    /* Second CMD0 */
    ret = SDCARD_SendCMD0();
    if(SDCARD_ERR_NONE != ret) {
        SD_PRINTF("SD Init  Error %d\r\n", __LINE__);
        SD_ChipSelect(false);
        return ret;
    }
    r1 = SDCARD_ReadR1();
    if(r1 < 0) {
        SD_ChipSelect(false);
        ret = r1;
        SD_PRINTF("SD Init  Error %d\r\n", __LINE__);
        return ret;
    }
    if(r1 != 0x01) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Init  Error %d (r1: 0x%02x)\r\n", __LINE__, r1);
        return SDCARD_ERR_UNKNOWN_CARD;
    }
    /*
     * Step 3.
     *   After the card enters idle state with a CMD0, send a CMD8 with argument of
     *   0x000001AA and correct CRC prior to initialization process. If the CMD8 is
     *   rejected with illegal command error (0x05), the card is SDC version 1 or
     *   MMC version 3. If accepted, R7 response (R1(0x01) + 32-bit return value)
     *   will be returned. The lower 12 bits in the return value 0x1AA means that
     *   the card is SDC version 2 and it can work at voltage range of 2.7 to 3.6 volts.
     *   If not the case, the card should be rejected.
    */
    ret = SDCARD_WaitNotBusy();
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Init  Error %d\r\n", __LINE__);
        return ret;
    }
    {
        uint8_t cmd[] =
            { 0x40 | 0x08 /* CMD8 */, 0x00, 0x00, 0x01, 0xAA /* ARG */, (0x43 << 1) | 1 /* CRC7 + end bit */ };
        while(pdTRUE == xSemaphoreTake(semHandle, 0));
        ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, BSP_SPI_CLK_156KHZ, semHandle, &status);
        if(ret != SPI_ERR_NONE) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init  Error %d\r\n", __LINE__);
            return ret;
        }
        if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init  Error %d\r\n", __LINE__);
            return SPI_ERR_TIMEOUT;
        }
        if(status != SPI_ERR_NONE) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init  Error %d\r\n", __LINE__);
            return status;
        }
    }

    r1 = SDCARD_ReadR1();
    if(r1 < 0) {
        SD_ChipSelect(false);
        ret = r1;
        SD_PRINTF("SD Init  Error %d\r\n", __LINE__);
        return ret;
    }
    if(r1 == 0x05) {
        // SD Ver1 or MMC Ver3
        SD_PRINTF("SD Init  Error %d\r\n", __LINE__);
        return SDCARD_ERR_UNSUPPORTED;  // SDSC not supported
    } else if(r1 == 0x01) {
        uint8_t resp[4];
        ret = SDCARD_ReadBytes(resp, sizeof(resp));
        if(ret != SPI_ERR_NONE) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return ret;
        }
        if(((resp[2] & 0x01) != 1) || (resp[3] != 0xAA)) {
            /* 0x1AA mismatch */
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return SDCARD_ERR_UNKNOWN_CARD;
        }
    } else {
        SD_ChipSelect(false);
        SD_PRINTF("SD Init Error %d\r\n", __LINE__);
        return SDCARD_ERR_UNKNOWN_CARD;
    }
    /*
     * Step 4.
     *   And then initiate initialization with ACMD41 with HCS flag (bit 30).
     */
    while(1) {
        ret = SDCARD_WaitNotBusy();
        if(ret != SPI_ERR_NONE) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return ret;
        }
        {
            uint8_t cmd[] =
                { 0x40 | 0x37 /* CMD55 */, 0x00, 0x00, 0x00, 0x00 /* ARG */, (0x7F << 1) | 1 /* CRC7 + end bit */ };
            while(pdTRUE == xSemaphoreTake(semHandle, 0));
            ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, BSP_SPI_CLK_156KHZ, semHandle, &status);
            if(ret != SPI_ERR_NONE) {
                SD_ChipSelect(false);
                SD_PRINTF("SD Init Error %d\r\n", __LINE__);
                return ret;
            }
            if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
                SD_ChipSelect(false);
                SD_PRINTF("SD Init Error %d\r\n", __LINE__);
                return SPI_ERR_TIMEOUT;
            }
            if(status != SPI_ERR_NONE) {
                SD_ChipSelect(false);
                SD_PRINTF("SD Init Error %d\r\n", __LINE__);
                return status;
            }
        }

        r1 = SDCARD_ReadR1();
        if(r1 < 0) {
            SD_ChipSelect(false);
            ret = r1;
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return ret;
        }
        if(r1 != 0x01) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return SDCARD_ERR_R1;
        }
        ret = SDCARD_WaitNotBusy();
        if(ret != SPI_ERR_NONE) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return ret;
        }
        {
            uint8_t cmd[] =
                { 0x40 | 0x29 /* ACMD41 */, 0x40, 0x00, 0x00, 0x00 /* ARG */, (0x7F << 1) | 1 /* CRC7 + end bit */ };
            while(pdTRUE == xSemaphoreTake(semHandle, 0));
            ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, BSP_SPI_CLK_156KHZ, semHandle, &status);
            if(ret != SPI_ERR_NONE) {
                SD_ChipSelect(false);
                SD_PRINTF("SD Init Error %d\r\n", __LINE__);
                return ret;
            }
            if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
                SD_ChipSelect(false);
                SD_PRINTF("SD Init Error %d\r\n", __LINE__);
                return SPI_ERR_TIMEOUT;
            }
            if(status != SPI_ERR_NONE) {
                SD_ChipSelect(false);
                SD_PRINTF("SD Init Error %d\r\n", __LINE__);
                return status;
            }
        }

        r1 = SDCARD_ReadR1();
        if(r1 < 0) {
            SD_ChipSelect(false);
            ret = r1;
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return ret;
        }
        if(r1 == 0x00) {
            break;
        }
        if(r1 != 0x01) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return SDCARD_ERR_R1;
        }
    }
    /*
     * Step 5.
     *   After the initialization completed, read OCR register with CMD58 and check
     *   CCS flag (bit 30). When it is set, the card is a high-capacity card known
     *   as SDHC/SDXC.
     */
    ret = SDCARD_WaitNotBusy();
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Init Error %d\r\n", __LINE__);
        return ret;
    }
    {
        uint8_t cmd[] =
            { 0x40 | 0x3A /* CMD58 */, 0x00, 0x00, 0x00, 0x00 /* ARG */, (0x7F << 1) | 1 /* CRC7 + end bit */ };
        while(pdTRUE == xSemaphoreTake(semHandle, 0));
        ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, BSP_SPI_CLK_156KHZ, semHandle, &status);
        if(ret != SPI_ERR_NONE) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return ret;
        }
        if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return SPI_ERR_TIMEOUT;
        }
        if(status != SPI_ERR_NONE) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return status;
        }
    }

    r1 = SDCARD_ReadR1();
    if(r1 < 0) {
        SD_ChipSelect(false);
        ret = r1;
        SD_PRINTF("SD Init Error %d\r\n", __LINE__);
        return ret;
    }
    if(r1 != 0x00) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Init Error %d\r\n", __LINE__);
        return SDCARD_ERR_R1;
    }
    {
        uint8_t resp[4];
        ret = SDCARD_ReadBytes(resp, sizeof(resp));
        if(ret != SPI_ERR_NONE) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return ret;
        }
        /*
         * OCR
         * bit31: Card Power Up Status (0: busy, 1: Ready)
         * bit30: Card Capacity Status (0: SDSC, 1: SDHC/SDXC)
         * bit29: UHS-II Card Status (0: NO, 1: YES)
         */
        if((resp[0] & 0xC0) != 0xC0) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Init Error %d\r\n", __LINE__);
            return SDCARD_ERR_UNSUPPORTED;
        }
    }

    SD_ChipSelect(false);
    bInit = true;

