sicrisembay/stm32g4_logger/board/stm32g474_board/main/bsp/sdcard/sdcard.c
    /*
     * Get SD Card Information
     */
    ret = SDCARD_ReadCardSpecificData(block_data, SDCARD_CSD_DATA_SIZE);
    if(ret != SDCARD_ERR_NONE) {
        SD_PRINTF("CSD Error %d\r\n", __LINE__);
        return ret;
    }
    // check READ_BL_LEN
    if((block_data[5] & 0x0F) != 0x09) {
        SD_PRINTF("READ_BL_LEN != 512 Byte\r\n");
        return SDCARD_ERR_UNSUPPORTED;
    }
    // check WRITE_BL_LEN
    if(((block_data[13] >> 6) + ((block_data[12] & 0x03) << 2)) != 0x09) {
        SD_PRINTF("WRITE_BL_LEN != 512 Byte\r\n");
        return SDCARD_ERR_UNSUPPORTED;
    }
    sdcard.csd_version = (block_data[0] >> 6) & 0x03;
    sdcard.max_block_count = block_data[9] + ((uint32_t)block_data[8] << 8) +
            ((uint32_t)(block_data[7] & 0x3F) << 16);
    sdcard.size = ((sdcard.max_block_count + 1) * 512) / 1024;

    return SDCARD_ERR_NONE;
}

#if 0
int SDCARD_GetBlocksNumber(uint32_t* num) {
    uint8_t csd[16];
    uint8_t crc[2];

    SDCARD_Select();

    if(SDCARD_WaitNotBusy() < 0) { // keep this!
        SDCARD_Unselect();
        return -1;
    }

    /* CMD9 (SEND_CSD) command */
    {
        static const uint8_t cmd[] =
            { 0x40 | 0x09 /* CMD9 */, 0x00, 0x00, 0x00, 0x00 /* ARG */, (0x7F << 1) | 1 /* CRC7 + end bit */ };
        HAL_SPI_Transmit(&SDCARD_SPI_PORT, (uint8_t*)cmd, sizeof(cmd), HAL_MAX_DELAY);
    }

    if(SDCARD_ReadR1() != 0x00) {
        SDCARD_Unselect();
        return -2;
    }

    if(SDCARD_WaitDataToken(DATA_TOKEN_CMD9) < 0) {
        SDCARD_Unselect();
        return -3;
    }

    if(SDCARD_ReadBytes(csd, sizeof(csd)) < 0) {
        SDCARD_Unselect();
        return -4;
    }

    if(SDCARD_ReadBytes(crc, sizeof(crc)) < 0) {
        SDCARD_Unselect();
        return -5;
    }

    SDCARD_Unselect();

    // first byte is VVxxxxxxxx where VV is csd.version
    if((csd[0] & 0xC0) != 0x40) // csd.version != 1
        return -6;

    uint32_t tmp = csd[7] & 0x3F; // two bits are reserved
    tmp = (tmp << 8) | csd[8];
    tmp = (tmp << 8) | csd[9];
    // Full volume: (C_SIZE+1)*512KByte == (C_SIZE+1)<<19
    // Block size: 512Byte == 1<<9
    // Blocks number: CARD_SIZE/BLOCK_SIZE = (C_SIZE+1)*(1<<19) / (1<<9) = (C_SIZE+1)*(1<<10)
    tmp = (tmp + 1) << 10;
    *num = tmp;

    return 0;
}
#endif


int32_t SDCARD_ReadOCR(uint32_t * pOCR)
{
    int32_t ret = SPI_ERR_NONE;
    int32_t status;
    int8_t r1;

    if(bInit != true) {
        return SDCARD_ERR_NOT_INITIALIZED;
    }

    SD_ChipSelect(true);

    ret = SDCARD_WaitNotBusy();
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read OCR Error %d\r\n", __LINE__);
        return ret;
    }
    /* CMD58 (READ_OCR) command */
    uint8_t cmd[] = {
            0x40 | 0x3A /* CMD58 */,
            0x00, 0x00, 0x00, 0x00 /* ARG */,
            (0x7F << 1) | 1 /* CRC7 + end bit */
    };
    while(pdTRUE == xSemaphoreTake(semHandle, 0));
    ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX, semHandle, &status);
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read OCR Error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read OCR Error %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read OCR Error %d\r\n", __LINE__);
        return status;
    }
    r1 = SDCARD_ReadR1();
    if(r1 < 0) {
        SD_ChipSelect(false);
        ret = r1;
        SD_PRINTF("SD Read OCR Error %d\r\n", __LINE__);
        return ret;
    }
    if(r1 != 0x00) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read OCR Error %d\r\n", __LINE__);
        return SDCARD_ERR_R1;
    }
    {
        uint8_t buff[4];
        ret = SDCARD_ReadBytes(buff, sizeof(buff));
        if(ret != SPI_ERR_NONE) {
            SD_ChipSelect(false);
            SD_PRINTF("SD Read OCR Error %d\r\n", __LINE__);
            return ret;
        }
        if(pOCR != NULL) {
            *pOCR = (((uint32_t)buff[0]) << 24) +
                    (((uint32_t)buff[1]) << 16) +
                    (((uint32_t)buff[2]) << 8) +
                    ((uint32_t)buff[3]);
        }

    }

    SD_ChipSelect(false);
    return SDCARD_ERR_NONE;
}


int32_t SDCARD_ReadCardIdentification(uint8_t * buff, size_t buffLen)
{
    int32_t ret = SPI_ERR_NONE;
    int32_t status;
    int8_t r1;

    if((buff == NULL) || (buffLen != SDCARD_CID_DATA_SIZE)) {
        return SDCARD_ERR_INVALID_ARG;
    }

    if(bInit != true) {
        return SDCARD_ERR_NOT_INITIALIZED;
    }

    SD_ChipSelect(true);

    ret = SDCARD_WaitNotBusy();
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CID Error %d\r\n", __LINE__);
        return ret;
    }

    /* CMD10 (SEND_CID) command */
    uint8_t cmd[] = {
        0x40 | 0x0A /* CMD10 */,
        0x00, 0x00, 0x00, 0x00, /* ARG */
        (0x7F << 1) | 1 /* CRC7 + end bit */
    };
    while(pdTRUE == xSemaphoreTake(semHandle, 0));  // clear any old sem
    ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX, semHandle, &status);
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CID Error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CID Error %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CID Error %d\r\n", __LINE__);
        return status;
    }

    r1 = SDCARD_ReadR1();
    if(r1 < 0) {
        SD_ChipSelect(false);
        ret = r1;
        SD_PRINTF("SD Read CID Error %d\r\n", __LINE__);
        return ret;
    }
    if(r1 != 0x00) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CID Error %d\r\n", __LINE__);
        return SDCARD_ERR_R1;
    }

    ret = SDCARD_WaitDataToken(DATA_TOKEN_CMD10);
    if(ret < 0) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CID Error %d\r\n", __LINE__);
        return ret;
    }

    ret = SDCARD_ReadBytes(buff, SDCARD_CID_DATA_SIZE);
    if(ret < 0) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CID Error %d\r\n", __LINE__);
        return ret;
    }

    SD_ChipSelect(false);
    return SDCARD_ERR_NONE;
}


int32_t SDCARD_ReadCardSpecificData(uint8_t * buff, size_t buffLen)
{
    int32_t ret = SPI_ERR_NONE;
    int32_t status;
    int8_t r1;

