sicrisembay/stm32g4_logger/board/stm32g474_board/main/bsp/sdcard/sdcard.c
    if((buff == NULL) || (buffLen != SDCARD_CSD_DATA_SIZE)) {
        return SDCARD_ERR_INVALID_ARG;
    }

    if(bInit != true) {
        return SDCARD_ERR_NOT_INITIALIZED;
    }

    SD_ChipSelect(true);

    ret = SDCARD_WaitNotBusy();
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CSD Error %d\r\n", __LINE__);
        return ret;
    }

    /* CMD9 (SEND_CSD) command */
    uint8_t cmd[] = {
        0x40 | 0x09 /* CMD9 */,
        0x00, 0x00, 0x00, 0x00, /* ARG */
        (0x7F << 1) | 1 /* CRC7 + end bit */
    };
    while(pdTRUE == xSemaphoreTake(semHandle, 0));  // clear any old sem
    ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX, semHandle, &status);
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CSD Error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CSD Error %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CSD Error %d\r\n", __LINE__);
        return status;
    }

    r1 = SDCARD_ReadR1();
    if(r1 < 0) {
        SD_ChipSelect(false);
        ret = r1;
        SD_PRINTF("SD Read CSD Error %d\r\n", __LINE__);
        return ret;
    }
    if(r1 != 0x00) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CSD Error %d\r\n", __LINE__);
        return SDCARD_ERR_R1;
    }

    ret = SDCARD_WaitDataToken(DATA_TOKEN_CMD9);
    if(ret < 0) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CSD Error %d\r\n", __LINE__);
        return ret;
    }

    ret = SDCARD_ReadBytes(buff, SDCARD_CSD_DATA_SIZE);
    if(ret < 0) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read CSD Error %d\r\n", __LINE__);
        return ret;
    }

    SD_ChipSelect(false);
    return SDCARD_ERR_NONE;}


int32_t SDCARD_ReadSingleBlock(uint32_t blockNum, uint8_t * buff, size_t buffLen)
{
    int32_t ret = SPI_ERR_NONE;
    int32_t status;
    int8_t r1;
    uint8_t crc[2];

    if((buff == NULL) || (buffLen != SDCARD_BLOCK_SIZE)) {
        return SDCARD_ERR_INVALID_ARG;
    }

    if(bInit != true) {
        return SDCARD_ERR_NOT_INITIALIZED;
    }

    SD_ChipSelect(true);

    ret = SDCARD_WaitNotBusy();
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read Single Block Error %d\r\n", __LINE__);
        return ret;
    }

    /* CMD17 (SEND_SINGLE_BLOCK) command */
    uint8_t cmd[] = {
        0x40 | 0x11 /* CMD17 */,
        (blockNum >> 24) & 0xFF, /* ARG */
        (blockNum >> 16) & 0xFF,
        (blockNum >> 8) & 0xFF,
        blockNum & 0xFF,
        (0x7F << 1) | 1 /* CRC7 + end bit */
    };

    while(pdTRUE == xSemaphoreTake(semHandle, 0));  // clear any old sem
    ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX, semHandle, &status);
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read Single Block Error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read Single Block Error %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read Single Block Error %d\r\n", __LINE__);
        return status;
    }

    r1 = SDCARD_ReadR1();
    if(r1 < 0) {
        SD_ChipSelect(false);
        ret = r1;
        SD_PRINTF("SD Read Single Block Error %d\r\n", __LINE__);
        return ret;
    }
    if(r1 != 0x00) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read Single Block Error %d\r\n", __LINE__);
        return SDCARD_ERR_R1;
    }

    ret = SDCARD_WaitDataToken(DATA_TOKEN_CMD17);
    if(ret < 0) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read Single Block Error %d\r\n", __LINE__);
        return ret;
    }

    ret = SDCARD_ReadBytes(buff, SDCARD_BLOCK_SIZE);
    if(ret < 0) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read Single Block Error %d\r\n", __LINE__);
        return ret;
    }

    ret = SDCARD_ReadBytes(crc, 2);
    if(ret < 0) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Read Single Block Error %d\r\n", __LINE__);
        return ret;
    }

    SD_ChipSelect(false);
    return SDCARD_ERR_NONE;
}


int32_t SDCARD_WriteSingleBlock(uint32_t blockNum, const uint8_t * buff,  size_t buffLen)
{
    int32_t ret = SPI_ERR_NONE;
    int32_t status;
    int8_t r1;

    if((buff == NULL) || (buffLen != SDCARD_BLOCK_SIZE)) {
        return SDCARD_ERR_INVALID_ARG;
    }

    if(bInit != true) {
        return SDCARD_ERR_NOT_INITIALIZED;
    }

    SD_ChipSelect(true);

    ret = SDCARD_WaitNotBusy();
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write Single Block Error %d\r\n", __LINE__);
        return ret;
    }

    /* CMD24 (WRITE_BLOCK) command */
    uint8_t cmd[] = {
        0x40 | 0x18 /* CMD24 */,
        (blockNum >> 24) & 0xFF, /* ARG */
        (blockNum >> 16) & 0xFF,
        (blockNum >> 8) & 0xFF,
        blockNum & 0xFF,
        (0x7F << 1) | 1 /* CRC7 + end bit */
    };

    while(pdTRUE == xSemaphoreTake(semHandle, 0));  // clear any old sem
    ret = BSP_SPI_transact(cmd, cmd, sizeof(cmd), SPI_MODE0, NULL, (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX, semHandle, &status);
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write Single Block Error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write Single Block Error %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write Single Block Error %d\r\n", __LINE__);
        return status;
    }

    r1 = SDCARD_ReadR1();
    if(r1 < 0) {
        SD_ChipSelect(false);
        ret = r1;
        SD_PRINTF("SD Write Single Block Error %d\r\n", __LINE__);
        return ret;
    }
    if(r1 != 0x00) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write Single Block Error %d\r\n", __LINE__);
        return SDCARD_ERR_R1;
    }

