sicrisembay/stm32g4_logger/board/stm32g474_board/main/bsp/sdcard/sdcard.c
    /*
     * Transmit Data Token (CMD24)
     */
    uint8_t dataToken = DATA_TOKEN_CMD24;
    while(pdTRUE == xSemaphoreTake(semHandle, 0));  // clear any old sem
    ret = BSP_SPI_transact(&dataToken, &dataToken, sizeof(dataToken), SPI_MODE0, NULL, (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX, semHandle, &status);
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write CMD24 Token Error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write CMD24 Token Timeout %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write CMD24 Token Error %d\r\n", __LINE__);
        return status;
    }

    /*
     * Transmit block
     */
    while(pdTRUE == xSemaphoreTake(semHandle, 0));  // clear any old sem
    ret = BSP_SPI_transact(buff, block_data, SDCARD_BLOCK_SIZE, SPI_MODE0, NULL, (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX, semHandle, &status);
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write Block Error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write Block Timeout %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write Block Error %d\r\n", __LINE__);
        return status;
    }

    /*
     * Transmit crc
     */
    uint8_t crc[2] = { 0xFF, 0xFF };
    while(pdTRUE == xSemaphoreTake(semHandle, 0));  // clear any old sem
    ret = BSP_SPI_transact(crc, crc, sizeof(crc), SPI_MODE0, NULL, (BSP_SPI_CLK_T)CONFIG_SDCARD_SPI_FREQ_IDX, semHandle, &status);
    if(ret != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write crc error %d\r\n", __LINE__);
        return ret;
    }
    if(pdTRUE != xSemaphoreTake(semHandle, SD_DEFAULT_TIMEOUT)) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write crc timeout %d\r\n", __LINE__);
        return SPI_ERR_TIMEOUT;
    }
    if(status != SPI_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write crc error %d\r\n", __LINE__);
        return status;
    }

    /*
        dataResp:
        xxx0abc1
            010 - Data accepted
            101 - Data rejected due to CRC error
            110 - Data rejected due to write error
    */
    uint8_t dataResp;
    ret = SDCARD_ReadBytes(&dataResp, sizeof(dataResp));
    if(ret != SDCARD_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write single block error %d\r\n", __LINE__);
        return ret;
    }
    if((dataResp & 0x1F) != 0x05) { // data rejected
        SD_PRINTF("SD Write single block rejected %d\r\n", __LINE__);
        SD_ChipSelect(false);
        return SDCARD_ERR_WRITE_REJECTED;
    }
    ret = SDCARD_WaitNotBusy();
    if(ret != SDCARD_ERR_NONE) {
        SD_ChipSelect(false);
        SD_PRINTF("SD Write S.ingle Block Error %d\r\n", __LINE__);
        return ret;
    }

    SD_ChipSelect(false);
    return SDCARD_ERR_NONE;
}


#if 0
int SDCARD_ReadBegin(uint32_t blockNum) {
    SDCARD_Select();

    if(SDCARD_WaitNotBusy() < 0) { // keep this!
        SDCARD_Unselect();
        return -1;
    }

    /* CMD18 (READ_MULTIPLE_BLOCK) command */
    uint8_t cmd[] = {
        0x40 | 0x12 /* CMD18 */,
        (blockNum >> 24) & 0xFF, /* ARG */
        (blockNum >> 16) & 0xFF,
        (blockNum >> 8) & 0xFF,
        blockNum & 0xFF,
        (0x7F << 1) | 1 /* CRC7 + end bit */
    };
    HAL_SPI_Transmit(&SDCARD_SPI_PORT, (uint8_t*)cmd, sizeof(cmd), HAL_MAX_DELAY);

    if(SDCARD_ReadR1() != 0x00) {
        SDCARD_Unselect();
        return -2;
    }

    SDCARD_Unselect();
    return 0;
}

int SDCARD_ReadData(uint8_t* buff) {
    uint8_t crc[2];
    SDCARD_Select();

    if(SDCARD_WaitDataToken(DATA_TOKEN_CMD18) < 0) {
        SDCARD_Unselect();
        return -1;
    }

    if(SDCARD_ReadBytes(buff, 512) < 0) {
        SDCARD_Unselect();
        return -2;
    }

    if(SDCARD_ReadBytes(crc, 2) < 0) {
        SDCARD_Unselect();
        return -3;
    }

    SDCARD_Unselect();
    return 0;

}

int SDCARD_ReadEnd() {
    SDCARD_Select();

    /* CMD12 (STOP_TRANSMISSION) */
    {
        static const uint8_t cmd[] = { 0x40 | 0x0C /* CMD12 */, 0x00, 0x00, 0x00, 0x00 /* ARG */, (0x7F << 1) | 1 };
        HAL_SPI_Transmit(&SDCARD_SPI_PORT, (uint8_t*)cmd, sizeof(cmd), HAL_MAX_DELAY);
    }

    /*
    The received byte immediataly following CMD12 is a stuff byte, it should be
    discarded before receive the response of the CMD12
    */
    uint8_t stuffByte;
    if(SDCARD_ReadBytes(&stuffByte, sizeof(stuffByte)) < 0) {
        SDCARD_Unselect();
        return -1;
    }

    if(SDCARD_ReadR1() != 0x00) {
        SDCARD_Unselect();
        return -2;
    }

    SDCARD_Unselect();
    return 0;
}


int SDCARD_WriteBegin(uint32_t blockNum) {
    SDCARD_Select();

    if(SDCARD_WaitNotBusy() < 0) { // keep this!
        SDCARD_Unselect();
        return -1;
    }

    /* CMD25 (WRITE_MULTIPLE_BLOCK) command */
    uint8_t cmd[] = {
        0x40 | 0x19 /* CMD25 */,
        (blockNum >> 24) & 0xFF, /* ARG */
        (blockNum >> 16) & 0xFF,
        (blockNum >> 8) & 0xFF,
        blockNum & 0xFF,
        (0x7F << 1) | 1 /* CRC7 + end bit */
    };
    HAL_SPI_Transmit(&SDCARD_SPI_PORT, (uint8_t*)cmd, sizeof(cmd), HAL_MAX_DELAY);

    if(SDCARD_ReadR1() != 0x00) {
        SDCARD_Unselect();
        return -2;
    }

    SDCARD_Unselect();
    return 0;
}

int SDCARD_WriteData(const uint8_t* buff) {
    SDCARD_Select();

    uint8_t dataToken = DATA_TOKEN_CMD25;
    uint8_t crc[2] = { 0xFF, 0xFF };
    HAL_SPI_Transmit(&SDCARD_SPI_PORT, &dataToken, sizeof(dataToken), HAL_MAX_DELAY);
    HAL_SPI_Transmit(&SDCARD_SPI_PORT, (uint8_t*)buff, 512, HAL_MAX_DELAY);
    HAL_SPI_Transmit(&SDCARD_SPI_PORT, crc, sizeof(crc), HAL_MAX_DELAY);

    /*
        dataResp:
        xxx0abc1
            010 - Data accepted
            101 - Data rejected due to CRC error
            110 - Data rejected due to write error
    */
    uint8_t dataResp;
    SDCARD_ReadBytes(&dataResp, sizeof(dataResp));
    if((dataResp & 0x1F) != 0x05) { // data rejected
        SDCARD_Unselect();
        return -1;
    }

    if(SDCARD_WaitNotBusy() < 0) {
        SDCARD_Unselect();
        return -2;
    }

    SDCARD_Unselect();
    return 0;
}

int SDCARD_WriteEnd() {
    SDCARD_Select();

    uint8_t stopTran = 0xFD; // stop transaction token for CMD25
    HAL_SPI_Transmit(&SDCARD_SPI_PORT, &stopTran, sizeof(stopTran), HAL_MAX_DELAY);

    // skip one byte before readyng "busy"
    // this is required by the spec and is necessary for some real SD-cards!
    uint8_t skipByte;
    SDCARD_ReadBytes(&skipByte, sizeof(skipByte));

    if(SDCARD_WaitNotBusy() < 0) {
        SDCARD_Unselect();
        return -1;
    }

    SDCARD_Unselect();
    return 0;
}
#endif
